views/dashboard/index.php

                            <!-- small box -->
                            <div class="small-box bg-green-gradient">
                                <div class="inner">
                                    <!--                    <h3>0</h3>-->
                                    <h3> <?=
                                    (new \yii\db\Query())->select('*')->from('location_unit')->count()
---
SELECT COUNT(*) FROM `location_unit`

                                    <!--                    <h3>0</h3>-->
                                    <h3> <?=
                                    // AssetItemSearch::getTotalAssetGodCondition()
                                    (new \yii\db\Query())->select('*')->from('asset_received')->where(['id_status_received' => 1])->count()
---
SELECT COUNT(*) FROM `asset_received` WHERE `id_status_received`=1

                                    <!--                    <h3>0</h3>-->
                                    <h3> <?=
                                    // AssetItemSearch::getTotalAssetGodCondition()
                                    (new \yii\db\Query())->select('*')->from('asset_received')->where(['id_status_received' => 2])->count()
---
SELECT COUNT(*) FROM `asset_received` WHERE `id_status_received`=2

                                    <!--                    <h3>0</h3>-->
                                    <h3> <?=
                                    // AssetItemSearch::getTotalAssetGodCondition()
                                    (new \yii\db\Query())->select('*')->from('asset_received')->where(['id_status_received' => 3])->count()
---
SELECT COUNT(*) FROM `asset_received` WHERE `id_status_received`=3

                                    <!--                    <h3>0</h3>-->
                                    <h3><?=
                                    // AssetItemSearch::getTotalAssetBadCondition() type_asset1
                                    (new \yii\db\Query())->select('*')->from('type_asset1')->count()
---
SELECT COUNT(*) FROM `type_asset1`

                                    <!--                    <h3>0</h3>-->
                                    <h3><?=
                                    // AssetItemSearch::getTotalAssetBadCondition() type_asset1
                                    (new \yii\db\Query())->select('*')->from('asset_master')->count()
---
SELECT COUNT(*) FROM `asset_master`

                                    <!--                    <h3>0</h3>-->
                                    <h3><?=
                                    // AssetItemSearch::getTotalAssetBadCondition() type_asset1
                                    (new \yii\db\Query())->select('*')->from('asset_item_location_unit')->count()
---
SELECT COUNT(*) FROM `asset_item_location_unit`

                                    <!--                    <h3>0</h3>-->
                                    <h3> <?=
                                    //AssetItemSearch::getTotalAssetBrokenCondition()
                                    (new \yii\db\Query())->select('*')->from('user')->count()
---
SELECT COUNT(*) FROM `user`

<?php

// Fetch and group the data from the database
$data = (new \yii\db\Query())
    ->select(['received_date', 'COUNT(id_asset_master) AS count'])
    ->from('asset_received')
    ->groupBy('received_date')
    ->all();
---
SELECT `received_date`, COUNT(id_asset_master) AS `count` FROM `asset_received` GROUP BY `received_date`