models/AppSettingSearch.php

	public static function getValueByKey($key, $defaultValue=""){
		$one = AppSetting::find()
                ->where(['setting_name' => $key])
                ->one();
---
SELECT * FROM `app_setting` WHERE `setting_name`='DEFAULT-COLOR'

	public static function getImageUrl($key, $defaultUrl){
		$one = AppSetting::find()
            ->where(['setting_name' => $key])
            ->one();
---
SELECT * FROM `app_setting` WHERE `setting_name`='MAIN-BACKGROUND'